eisup_2019_docmng_integration/src/Documents/абс_РаспределениеРесурсовНаПроект/абс_РаспределениеРесурсовНаПроект.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_РаспределениеРесурсовНаПроект</name>
  <registerRecords>AccumulationRegister.ОборотыБюджетов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодРаспределения</name>
    <type>
      <types>EnumRef.абс_МетодыРаспределенияРесурсовПоПроектам</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РаспределениеПоПроектам</name>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяОборотов</name>
      <type>
        <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
      </type>
    </attributes>
    <attributes>
      <name>КВ</name>
      <type>
        <types>CatalogRef.абс_КапитальныеВложения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТЭО</name>
      <type>
        <types>CatalogRef.абс_ТЭО</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФУ</name>
      <type>
        <types>CatalogRef.абс_ЦФУ</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>МетодРаспределения</name>
      <type>
        <types>EnumRef.абс_МетодыРаспределенияРесурсовПоПроектам</types>
      </type>
    </attributes>
    <attributes>
      <name>РесурсПроекта</name>
      <type>
        <types>CatalogRef.абс_РесурсыПроектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регистратор</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРаспределения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОшибкиРаспредления</name>
    <attributes>
      <name>ОписаниеОшибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/AccumulationRegisters/ОборотыБюджетов/ОборотыБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОборотыБюджетов</name>
  <comment>(Упр)</comment>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаСценария</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяОборотов</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ТипКонтрагента</name>
    <type>
      <types>CatalogRef.абс_ТипыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ТипСети</name>
    <type>
      <types>CatalogRef.абс_ТипыСетей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_КВ</name>
    <type>
      <types>CatalogRef.абс_КапитальныеВложения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ТЭО</name>
    <type>
      <types>CatalogRef.абс_ТЭО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_ТипРасхода</name>
    <type>
      <types>CatalogRef.абс_ТипыРасходовНаПроизводствоИРеализацию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>абс_СчетБУ</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ttk_ОбъектБюджетирования</name>
    <type>
      <types>CatalogRef.ttk_ОбъектыБюджетирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ttk_Город</name>
    <type>
      <types>CatalogRef.ttk_Города</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/Enums/абс_МетодыРаспределенияРесурсовПоПроектам/абс_МетодыРаспределенияРесурсовПоПроектам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_МетодыРаспределенияРесурсовПоПроектам</name>
  <enumValues>
    <name>ПоНатуральнымПоказателям</name>
  </enumValues>
  <enumValues>
    <name>ПоПрямымЗатратам</name>
  </enumValues>
  <enumValues>
    <name>ПоОбъемуВыручки</name>
  </enumValues>
  <enumValues>
    <name>НаПроект</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_РаспределениеРесурсовНаПроект/Forms/ФормаДокумента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьПараметрыДинамическихСписков();
	УстановитьЗначенияЛокальныхПеременных();
	УстановитьВидимостьТаблицаОшибок();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если ОчиститьТекущееРаспределение() Тогда
		УстановитьЗначенияЛокальныхПеременных();
		УстановитьПараметрыДинамическихСписков();
	Иначе
		Объект.Организация = мОрганизация;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МетодРаспределенияПриИзменении(Элемент)
	
	Если ОчиститьТекущееРаспределение() Тогда
		УстановитьЗначенияЛокальныхПеременных();
		УстановитьПараметрыДинамическихСписков();
	Иначе
		Объект.МетодРаспределения = мМетодРаспределения;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)

	Если ОчиститьТекущееРаспределение() Тогда
		Объект.Дата = КонецМесяца(Объект.Дата);
		УстановитьЗначенияЛокальныхПеременных();
		УстановитьПараметрыДинамическихСписков();
	Иначе
		Объект.Дата = мПериод;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеДляРаспределенияПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("СписокПриАктивизацииСтрокиОбработчикОжидания", 0.1, Истина);	
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьНаСервере();
	УстановитьПараметрыДинамическихСписков();
	УстановитьВидимостьТаблицаОшибок();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Объект.ОшибкиРаспредления.Очистить();
	
	МассивОшибок = Новый Массив;
	Если Объект.МетодРаспределения = Перечисления.абс_МетодыРаспределенияРесурсовПоПроектам.ПоНатуральнымПоказателям Тогда 
		Объект.РаспределениеПоПроектам.Загрузить(
					Документы.абс_РаспределениеРесурсовНаПроект.РаспределитьПоНатуральнымПоказателям(Объект.Организация, Объект.Дата, МассивОшибок));
	ИначеЕсли Объект.МетодРаспределения = Перечисления.абс_МетодыРаспределенияРесурсовПоПроектам.ПоОбъемуВыручки Тогда 
		Объект.РаспределениеПоПроектам.Загрузить(
					Документы.абс_РаспределениеРесурсовНаПроект.РаспределитьПоОборотамБюджета(Объект.Организация, Объект.Дата,,МассивОшибок));
	ИначеЕсли Объект.МетодРаспределения = Перечисления.абс_МетодыРаспределенияРесурсовПоПроектам.ПоПрямымЗатратам Тогда 
		Объект.РаспределениеПоПроектам.Загрузить(
					Документы.абс_РаспределениеРесурсовНаПроект.РаспределитьПоОборотамБюджета(Объект.Организация, Объект.Дата, Ложь,МассивОшибок));
	КонецЕсли;
	
	Для Каждого текстОшибки из МассивОшибок Цикл 
		стркоаТаблицыОшибок = Объект.ОшибкиРаспредления.Добавить();
		стркоаТаблицыОшибок.ОписаниеОшибки = текстОшибки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОборотыБюджета(Команда)
	
	СтруктураПараметров = Новый Структура("Отбор", Новый Структура("Регистратор", Объект.Ссылка));
	ОткрытьФорму("РегистрНакопления.ОборотыБюджетов.ФормаСписка", СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ОшибкиРаспределения(Команда)
	
	МассивОшибок = Новый Массив;
	Для Каждого строка из Объект.ОшибкиРаспредления Цикл 
		МассивОшибок.Добавить(строка.ОписаниеОшибки);		
	КонецЦикла;
	
	ОткрытьФорму("Документ.абс_РаспределениеРесурсовНаПроект.Форма.ФормаОшибок", Новый Структура("МассивОшибок", МассивОшибок), ЭтаФорма); 
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЧИЕ ПРОЦЕДУРЫ И ФУНКЦИИ


&НаКлиенте
Процедура УстановитьПараметрыДинамическихСписков()
	
	ЗатратыПоПроекту.Параметры.УстановитьЗначениеПараметра("Организация", 			Объект.Организация);
	ЗатратыПоПроекту.Параметры.УстановитьЗначениеПараметра("МетодРаспределения", 	Объект.МетодРаспределения);
	ЗатратыПоПроекту.Параметры.УстановитьЗначениеПараметра("НачалоПериода", 		НачалоМесяца(Объект.Дата));
	ЗатратыПоПроекту.Параметры.УстановитьЗначениеПараметра("КонецПериода",  		Новый Граница(КонецМесяца(Объект.Дата)));
	ЗатратыПоПроекту.Параметры.УстановитьЗначениеПараметра("Использование", 		Истина);
	
	РесурсыПоПроектам.Параметры.УстановитьЗначениеПараметра("Организация", 	Объект.Организация);
	РесурсыПоПроектам.Параметры.УстановитьЗначениеПараметра("КонецПериода", Новый Граница(КонецМесяца(Объект.Дата)));
	
	ОборотыБюджета.Параметры.УстановитьЗначениеПараметра("Организация", 	Объект.Организация);
	ОборотыБюджета.Параметры.УстановитьЗначениеПараметра("НачалоПериода", 	НачалоМесяца(Объект.Дата));
	ОборотыБюджета.Параметры.УстановитьЗначениеПараметра("КонецПериода",  	Новый Граница(КонецМесяца(Объект.Дата)));
    ОборотыБюджета.Параметры.УстановитьЗначениеПараметра("МассивСценариев", ПолучитьМассивСценариевФакт());
	
	Если Объект.МетодРаспределения = Перечисления.абс_МетодыРаспределенияРесурсовПоПроектам.ПоНатуральнымПоказателям Тогда 
		ОборотыБюджета.Параметры.УстановитьЗначениеПараметра("Использование", 	 Ложь);
		РесурсыПоПроектам.Параметры.УстановитьЗначениеПараметра("Использование", Истина);
		Элементы.ОборотыБюджета.Видимость 	 = Ложь;
		Элементы.РесурсыПоПроектам.Видимость = Истина;
	ИначеЕсли Объект.МетодРаспределения = Перечисления.абс_МетодыРаспределенияРесурсовПоПроектам.ПоОбъемуВыручки Тогда 
		ОборотыБюджета.Параметры.УстановитьЗначениеПараметра("Использование", 		Истина);
		РесурсыПоПроектам.Параметры.УстановитьЗначениеПараметра("Использование", 	Ложь);
		ОборотыБюджета.Параметры.УстановитьЗначениеПараметра("Доходная", 			Истина);
		Элементы.ОборотыБюджета.Видимость    =	Истина;
		Элементы.РесурсыПоПроектам.Видимость = 	Ложь;
	ИначеЕсли Объект.МетодРаспределения = Перечисления.абс_МетодыРаспределенияРесурсовПоПроектам.ПоПрямымЗатратам Тогда 
		ОборотыБюджета.Параметры.УстановитьЗначениеПараметра("Использование", 		Истина);
		РесурсыПоПроектам.Параметры.УстановитьЗначениеПараметра("Использование", 	Ложь);
		ОборотыБюджета.Параметры.УстановитьЗначениеПараметра("Доходная", 			Ложь);
		Элементы.ОборотыБюджета.Видимость 	 = Истина;
		Элементы.РесурсыПоПроектам.Видимость = Ложь;
	Иначе
		ОборотыБюджета.Параметры.УстановитьЗначениеПараметра("Использование", 		Ложь);
		РесурсыПоПроектам.Параметры.УстановитьЗначениеПараметра("Использование", 	Ложь);
		ОборотыБюджета.Параметры.УстановитьЗначениеПараметра("Доходная", 			Истина);
		Элементы.ОборотыБюджета.Видимость 	 = 	Истина;
		Элементы.РесурсыПоПроектам.Видимость = 	Ложь;		
	КонецЕсли;
	
	Если Объект.РаспределениеПоПроектам.Количество() = 0 Тогда 
		ЗатратыПоПроекту.Параметры.УстановитьЗначениеПараметра("Использование", 	Ложь);
		ОборотыБюджета.Параметры.УстановитьЗначениеПараметра("Использование", 		Ложь);
		РесурсыПоПроектам.Параметры.УстановитьЗначениеПараметра("Использование", 	Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтрокиОбработчикОжидания()
	
	ТекущиеДанные = Элементы.ДанныеДляРаспределения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	РаспределениеПоПроектам = (ТекущиеДанные.ВидРаспределения = 2);
		
	Если Объект.МетодРаспределения = Перечисления.абс_МетодыРаспределенияРесурсовПоПроектам.ПоНатуральнымПоказателям Тогда 
		УстановитьЭлементОтбора(ЗатратыПоПроекту.Отбор, "РесурсПроекта", ТекущиеДанные.РесурсПроекта, ВидСравненияКомпоновкиДанных.Равно,, Истина);		
		УстановитьЭлементОтбора(РесурсыПоПроектам.Отбор, "Ресурс", ТекущиеДанные.РесурсПроекта, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		УстановитьЭлементОтбора(ЗатратыПоПроекту.Отбор, "ДоговорКонтрагента", ТекущиеДанные.ДоговорКонтрагента, ВидСравненияКомпоновкиДанных.Равно,, Ложь);		
	ИначеЕсли Объект.МетодРаспределения = Перечисления.абс_МетодыРаспределенияРесурсовПоПроектам.ПоОбъемуВыручки
		ИЛИ Объект.МетодРаспределения = Перечисления.абс_МетодыРаспределенияРесурсовПоПроектам.ПоПрямымЗатратам Тогда 
		УстановитьЭлементОтбора(ЗатратыПоПроекту.Отбор, "ДоговорКонтрагента", ТекущиеДанные.ДоговорКонтрагента, ВидСравненияКомпоновкиДанных.Равно,, Истина);		
		УстановитьЭлементОтбора(ЗатратыПоПроекту.Отбор, "РесурсПроекта", ТекущиеДанные.РесурсПроекта, ВидСравненияКомпоновкиДанных.Равно,, Ложь);
		//УстановитьЭлементОтбора(ОборотыБюджета.Отбор, "ДоговорКонтрагента", ТекущиеДанные.ДоговорКонтрагента, ВидСравненияКомпоновкиДанных.Равно,, РаспределениеПоПроектам);
		//Элементы.ОборотыБюджетаДоговорКонтрагента.Видимость = РаспределениеПоПроектам;
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Функция ОчиститьТекущееРаспределение()
	
	Если Объект.РаспределениеПоПроектам.Количество() = 0 Тогда 
		Возврат Истина;
	КонецЕсли;
	
	ИзменилисьПараметры = Ложь;
	
	Если ЗначениеЗаполнено(мОрганизация) И (мОрганизация <> Объект.Организация) Тогда 
		ИзменилисьПараметры = Истина;
	КонецЕсли;

	Если ЗначениеЗаполнено(мМетодРаспределения) И (мМетодРаспределения <> Объект.МетодРаспределения) Тогда 
		ИзменилисьПараметры = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(мПериод) И (КонецМесяца(мПериод) <> КонецМесяца(Объект.Дата)) Тогда 
		ИзменилисьПараметры = Истина;
	КонецЕсли;
	
	Если ИзменилисьПараметры Тогда  		
		ТекстВопроса = НСтр("ru='Текущее распределение по проектам будет очищено. Продолжить?'");
		Ответ = Вопрос(ТекстВопроса,РежимДиалогаВопрос.ДаНет);	
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат Ложь;
		КонецЕсли;		
		Объект.РаспределениеПоПроектам.Очистить();
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьТаблицаОшибок()
	
	Если Объект.ОшибкиРаспредления.Количество() > 0 Тогда 
		//Сообщить("Возникли ошибки при распределении затрт по проектам. Для ознакомления перейдите по ссылке: ошибки распределения");
		Элементы.ГруппаОшибкиРаспределения.Видимость = Истина;
	Иначе
		Элементы.ГруппаОшибкиРаспределения.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура  УстановитьЗначенияЛокальныхПеременных()
	
	мОрганизация = Объект.Организация;
	мПериод = Объект.Дата;
	мМетодРаспределения = Объект.МетодРаспределения;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивСценариевФакт() 
	
	Возврат Документы.абс_РаспределениеРесурсовНаПроект.ПолучитьМассивСценариевФакт();
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УСТАНОВКИ ОТБОРОВ В ДИНАМИЧЕСКОМ СПИСКЕ


// Используется для создания элемента отбора или, если таковой не найден,
// установления существующим элементам свойств
// Параметры
//  ОбластьПоискаДобавления - контейнер с элементами и группами отбора, например
//                  Список.Отбор или группа в отборе
//  ИмяПоля - строка - имя для поля компоновки данных (заполняется всегда)
// Устанавливаемые поля:
//  ВидСравнения - ВидСравненияКомпоновкиДанных - вид сравнения
//  ПравоеЗначение - произвольный
//  Представление - представление элемента компоновки данных
//  Использование - булево - использование элемента
//  РежимОтображения - РежимОтображенияЭлементаНастройкиКомпоновкиДанных - режим отображения
//
&НаКлиенте
Процедура УстановитьЭлементОтбора(ОбластьПоискаДобавления,
								знач ИмяПоля,
								знач ПравоеЗначение = Неопределено,
								знач ВидСравнения = Неопределено,
								знач Представление = Неопределено,
								знач Использование = Неопределено,
								знач РежимОтображения = Неопределено) Экспорт
	
	ЧислоИзмененных = ИзменитьЭлементыОтбора(ОбластьПоискаДобавления, ИмяПоля, Представление,
							ПравоеЗначение, ВидСравнения, Использование, РежимОтображения);
	
	Если ЧислоИзмененных = 0 Тогда
		Если ВидСравнения = Неопределено Тогда
			ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		КонецЕсли;
		ДобавитьЭлементКомпоновки(ОбластьПоискаДобавления, ИмяПоля, ВидСравнения,
								ПравоеЗначение, Представление, Использование, РежимОтображения);
	КонецЕсли;
	
КонецПроцедуры

// Изменение элементов отбора
// Параметры
//  ИмяПоля - строка - имя поля компоновки
//  ВидСравнения - ВидСравненияКомпоновкиДанных - вид сравнения
//  ПравоеЗначение - произвольный
//  Представление - строка - представление элемента компоновки данных
//  Использование - булево - использование элемента
//  РежимОтображения - РежимОтображенияЭлементаНастройкиКомпоновкиДанных - режим отображения
//
&НаКлиенте
Функция ИзменитьЭлементыОтбора(ОбластьПоиска,
								знач ИмяПоля = Неопределено,
								знач Представление = Неопределено,
								знач ПравоеЗначение = Неопределено,
								знач ВидСравнения = Неопределено,
								знач Использование = Неопределено,
								знач РежимОтображения = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ИмяПоля) Тогда
		ЗначениеПоиска = Новый ПолеКомпоновкиДанных(ИмяПоля);
		СпособПоиска = 1;
	Иначе
		СпособПоиска = 2;
		ЗначениеПоиска = Представление;
	КонецЕсли;
	
	МассивЭлементов = Новый Массив;
	
	НайтиРекурсивно(ОбластьПоиска.Элементы, МассивЭлементов, СпособПоиска, ЗначениеПоиска);
	
	Для Каждого Элемент Из МассивЭлементов Цикл
		Если ИмяПоля <> Неопределено Тогда
			Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
		КонецЕсли;
		Если Представление <> Неопределено Тогда
			Элемент.Представление = Представление;
		КонецЕсли;
		Если Использование <> Неопределено Тогда
			Элемент.Использование = Использование;
		КонецЕсли;
		Если ВидСравнения <> Неопределено Тогда
			Элемент.ВидСравнения = ВидСравнения;
		КонецЕсли;
		Если ПравоеЗначение <> Неопределено Тогда
			Элемент.ПравоеЗначение = ПравоеЗначение;
		КонецЕсли;
		Если РежимОтображения <> Неопределено Тогда
			Элемент.РежимОтображения = РежимОтображения;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивЭлементов.Количество();
	
КонецФункции

// Добавление элемента компоновки в контейнер элементов компоновки
// Параметры:
//  ОбластьДобавления - контейнер с элементами и группами отбора, например
//                  Список.Отбор или группа в отборе
//  ИмяПоля - строка - имя для поля компоновки данных
//  ВидСравнения - ВидСравненияКомпоновкиДанных - вид сравнения
//  ПравоеЗначение - произвольный
//  Представление - представление элемента компоновки данных
//  Использование - булево - использование элемента
//  РежимОтображения - РежимОтображенияЭлементаНастройкиКомпоновкиДанных - режим отображения
//
&НаКлиенте
Функция ДобавитьЭлементКомпоновки(ОбластьДобавления,
									знач ИмяПоля,
									знач ВидСравнения,
									знач ПравоеЗначение = Неопределено,
									знач Представление  = Неопределено,
									знач Использование  = Неопределено,
									знач РежимОтображения = Неопределено) Экспорт
	
	Элемент = ОбластьДобавления.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	Элемент.ВидСравнения = ВидСравнения;
	
	Если РежимОтображения = Неопределено Тогда
		Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	Иначе
		Элемент.РежимОтображения = РежимОтображения;
	КонецЕсли;
	
	Если ПравоеЗначение <> Неопределено Тогда
		Элемент.ПравоеЗначение = ПравоеЗначение;
	КонецЕсли;
	
	Если Представление <> Неопределено Тогда
		Элемент.Представление = Представление;
	КонецЕсли;
	
	Если Использование <> Неопределено Тогда
		Элемент.Использование = Использование;
	КонецЕсли;
	
	Возврат Элемент;
	
КонецФункции

&НаКлиенте
Процедура НайтиРекурсивно(КоллекцияЭлементов, МассивЭлементов, СпособПоиска, ЗначениеПоиска)
	
	Для каждого ЭлементОтбора Из КоллекцияЭлементов Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			
			Если СпособПоиска = 1 Тогда
				Если ЭлементОтбора.ЛевоеЗначение = ЗначениеПоиска Тогда
					МассивЭлементов.Добавить(ЭлементОтбора);
				КонецЕсли;
			ИначеЕсли СпособПоиска = 2 Тогда
				Если ЭлементОтбора.Представление = ЗначениеПоиска Тогда
					МассивЭлементов.Добавить(ЭлементОтбора);
				КонецЕсли;
			КонецЕсли;
		Иначе
			
			НайтиРекурсивно(ЭлементОтбора.Элементы, МассивЭлементов, СпособПоиска, ЗначениеПоиска);
			
			Если СпособПоиска = 2 И ЭлементОтбора.Представление = ЗначениеПоиска Тогда
				МассивЭлементов.Добавить(ЭлементОтбора);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
